{
  "data": [
    {
      "id": 1,
      "date": "JUNE 20, 2023",
      "readTime": "3 MIN READ",
      "title": "Mastering Next.js 13.4: A Comprehensive Guide for React Beginners",
      "slug": "mastering-next-js-13.4-a-comprehensive-guide-for-react-beginners",
      "description": "Explore strategies for recognition and rewards, and discover the benefits of continuous career progression for talent management and employee growth.",
      "image": "/images/first_blog.jpg",
      "author": "Kisakye Moses",
      "jobTitle": "Web Developer",
      "thumbnail": "/images/third_blog.jpg",
      "banner": "/images/banner-01.jpg",
      "detailedTitle": "1.1 What is Next.js?",
      "firstParagraph": "Next.js is a popular open-source framework built on top of React that simplifies the process of creating server-rendered React applications. Developed by Vercel, Next.js provides a set of features and optimizations that make it easier to build scalable, high-performance web applications with a focus on developer experience and best practices. With Next.js, you can build user interfaces using **React components**. Then, Next.js provides additional structure, features, and optimizations for your application. Under the hood, Next.js also abstracts and automatically configures tooling for you, like bundling, compiling, and more. This allows you to focus on building your application instead of spending time setting up tooling. Whether you're an individual developer or part of a larger team, Next.js can help you build interactive, dynamic, and fast web applications",
      "subTitle": "1.2 Why use Next.js 13.4?",
      "secondParagraph": "Next.js 13.4 brings several new features and improvements to the framework, making it an even more powerful tool for React developers. Some of the key benefits of using Next.js 13.4 include:- Improved performance: Next.js 13.4 introduces optimizations that result in faster build times and better runtime performance.- Enhanced developer experience: The latest version of Next.js offers better error handling, improved debugging, and more helpful error messages.- New features: Next.js 13.4 introduces new features such as Server Actions (alpha) and App Router, which provide additional flexibility and functionality for developers.",
      "subTitle2": "2.2 Installing Node.js and npm",
      "thirdParagraph": "To install Node.js and npm, follow these steps:1. Visit the official Node.js website (https://nodejs.org/) and download the appropriate installer for your operating system.2. Run the installer and follow the on-screen instructions to install Node.js and npm. After the installation is complete, you can verify that Node.js and npm are installed by running the following commands in your terminal:",
      "bannerImage": "/images/banner-01.jpg"
    },

    {
      "id": 2,
      "date": "JUNE 14, 2023",
      "readTime": "3/HALF MIN READ",
      "title": "Retention through coaching: Turn managers into coaches to create opportunities for employee impact",
      "slug": "retention-through-coaching-turn-managersinto-coaches-to-create-opportunities-for-employee-impact",
      "description": "Keep folks on their current path, build systems and coaching culture, and learn new perspectives about coaching and why it's critical to retention.",
      "image": "/images/second_blog.jpg",
      "author": "Kisakye Moses",
      "jobTitle": "Graphics Developer",
      "thumbnail": "/images/second_blog.jpg",
      "banner": "/images/banner-01.jpg",
      "detailedTitle": "Managers Develop Diverse and Distributed Teams",
      "firstParagraph": "Research indicates that remote and distributed work is on the rise, with more individuals and organizations considering it a viable option, especially since the pandemic. This trend is driven by many factors, such as the ability to expand the talent pool, greater flexibility in working arrangements, cost savings on infrastructure, and improved work-life balance. However, it's worth considering how this shift towards a more distributed workforce impacts our approach to team development as leaders. I spoke to two colleagues in the People space, Aloka Penmetcha, Product Leader at Shopify, and Jay O'Connor, Senior Director of Engineering at Slack, to gain insights on how they are managing and developing their distributed teams. <br/> I was curious about how remote management works and how managers can keep track of their teams. Jay explained that remote management is similar to in-person management but has differences. When managing remotely, leaders and employees must create value differently. Effective communication is essential, and leaders must embody the same expectations as they would in person.",
      "subTitle": "Building camaraderie within your team",
      "secondParagraph": "Aloka mentioned that remote management has changed how they build relationships within the team. Checking in over messaging apps and having more casual conversations during one-on-one meetings has been helpful. Jay emphasized the importance of taking time at the beginning of meetings to connect on a personal level.<br/> I couldn’t agree more. I know I make sure I have plenty of time in my meetings. So we can have just that five minutes of “How's it going? How are your kids doing?” Visiting with one another builds relationships.<br/> Jay recommends team members take two minutes to chat and build personal connections. Aloka's team uses a Slack channel, plays remote games, and has team-building events. Jay suggests replicating office interactions virtually, such as coffee breaks or water cooler chats. I like to encourage pair programming and setting working meetings which can increase productivity and social connections.  Remote work presents challenges in building camaraderie, but making an effort to connect is important. Remote work can make networking and career connections harder, so managers must be aware of this. Making connections is essential for growth, success, working well with others, and being inclusive. Finding mentors within the company can also provide growth opportunities.",
      "subTitle2": "Tips on communicating company cultural norms",
      "thirdParagraph": "Organization-specific norms are crucial for work. Unlike technical and theoretical knowledge, 'how we do things around here' varies across companies and is often implicit. This becomes even more challenging for distributed teams working remotely, making communicating company culture difficult. I wondered if my colleagues had tips on teaching new people how to work. I like to make Q&A documents; if someone has a question, you can just write down the question and the answer to share with others.<br/> How can we teach people to work together, and how do we lead to create an effective team culture, especially when working remotely? According to Jay, one way to do this is to lead by example and work in public - that is, show others what you're doing and how you're working. Document it. Share it. Make it visible so that others can learn from you. <br/> Also, make sure everyone knows what's expected of them on the job by defining cultural norms, career ladders, and job rubrics. This way, everyone knows what to do to succeed and can work towards their goals. This, of course, is what we do best at Pando. Embedding work expectations and core competencies in your job rubrics and career ladder helps enshrine your cultural norms. By doing this, you're saying this isn't just a nice to have, it’s critical for you to do your job and for your career.<br/> Building camaraderie and managing time zone differences can be challenging when working remotely. However, you can still contribute to the team's success by providing constructive feedback and messages. Documentation, such as recording daily summaries, can be helpful. Having at least a three-hour overlap between colleagues is crucial - but this is not always possible, especially in teams that are distributed globally. Establishing clear expectations, such as outlining suitable remote projects and alternating meeting times, is important. For new team members, additional overlapping hours during the onboarding period can be beneficial with clear communication and expectations. I have also practiced alternating meeting times to ensure that both parties share the burden of attendance. Both sides feel the pain of either starting super early or working a bit later in the day. They develop empathy for the other person, and it helps people realize just how valuable their time together is.",
      "bannerImage": "/images/banner-02.jpg"
    },
    {
      "id": 3,
      "date": "JUNE 1, 2023",
      "readTime": "2 MIN READ",
      "title": "Recognizing and rewarding employees in a challenging economic environment!",
      "slug": "recognizing-and-rewarding-employees-in-a-challenging-economic-environment!",
      "description": "How do we 'do' Inclusion? What do leaders really need to think about? Learn how to help managers build diverse teams. ",
      "image": "/images/third_blog.jpg",
      "author": "Uncle Moses",
      "jobTitle": "Web Developer",
      "thumbnail": "/images/third_blog.jpg",
      "banner": "/images/banner-01.jpg",
      "detailedTitle": "Curiosity and Consistency: How people managers can empower and grow diverse teams",
      "firstParagraph": "As a woman of color who has spent most of my career coming up in a field dominated by men, I was fortunate enough to have been encouraged to advocate for myself—for the way I work best and the circumstances that enable me to achieve my best results. I recognize that not everyone is fortunate enough to have those opportunities, and this realization led me on a journey to help other people have the same supportive work environment. <br />  I’ve worked with a lot of leaders and founders on how to support their teams, so it gave me great pleasure to have the opportunity to sit with my friend, Will Guerra, Head of Culture, Innovation, & Strategy at tEQuitable, to chat about how we can develop managers to empower diverse teams. <br /> <br />Will shared that it was when he found himself in a management consulting role—where he had the opportunity to work on some pretty significant cultural transformation work with large organizations—that he really discovered his passion for diversity, equity, and inclusion. It gave him 'the language to finally understand all the experiences that I had in my life…and of course, from a professional perspective, it just helped me lean even moreinto [becoming] a better people manager.'",
      "subTitle": "Framing Diversit",
      "secondParagraph": "What do we mean when we talk about diverse teams? What is diversity?According to Will, a diverse team is a “group of individuals who have different backgrounds and skills that work together to achieve common goals. They might have differences regarding age, nationality, ethnicity, education, professional background, skills,and of course, different ways of thinking,” and the data shows that diverse teams can outperform less diverse groups by over 30%. We know that diverse teams can increase creativity and innovation. They are better at problem-solving and decision-making. And we also know that individuals can develop and expand their existing skill sets by working collaboratively within a diverse environment—all of which points to increased engagement and reduced turnover. Will says,'This is where leaders need to make sure that everyone feels that they have a voice and contribute to the work of creating space foreveryone to feel included, no matter what their role is...what we’re talking about [here] is inclusion.'",
      "subTitle2": "How Do We Do Inclusion?",
      "thirdParagraph": "Will made some great points about the benefits of diversity and inclusion. When we think about creating diverse teams within organizations, we need to think about a duality. Many organizations are putting resources toward supporting DEI initiatives, and there are many things going on in the People space showing that work is being done to increase inclusion in the workplace. But, I would argue that there’s a big difference, a disconnect between doing inclusion (i.e., making public diversity statements, advertising inclusive policies) and being inclusive. We need to focus on our intentions, like how do we show up as leaders and organizations to support and build diverse teams? It’s a critical but overlooked area of focus. Organizations may be hiring from diverse, marginalized, non-traditional groups, but if the intention behind that is purely so that the numbers look good, “we were able to hire so that our customers are happy,” then we’re not coming from the right intention. If the intentions are not aligned the implementationwill not land well.",
      "bannerImage": "/images/banner-01.jpg"
    },
    {
      "id": 4,
      "date": "JUNE 20, 2023",
      "readTime": "3 MIN READ",
      "title": "Recognizing and rewarding employees in a challenging economic environment!.",
      "slug": "recognizing-and-rewarding-employees-in-a-chalenging-economic-environment!",
      "description": "Explore strategies for recognition and rewards, and discover the benefits of continuous career progression for talent management and employee growth.",
      "image": "/images/first_blog.jpg",
      "author": "Kisakye Moses",
      "jobTitle": "Graphics Developer",
      "thumbnail": "/images/second_blog.jpg",
      "banner": "/images/banner-01.jpg",
      "detailedTitle": "Managers Develop Diverse and Distributed Teams",
      "firstParagraph": "Research indicates that remote and distributed work is on the rise, with more individuals and organizations considering it a viable option, especially since the pandemic. This trend is driven by many factors, such as the ability to expand the talent pool, greater flexibility in working arrangements, cost savings on infrastructure, and improved work-life balance. However, it's worth considering how this shift towards a more distributed workforce impacts our approach to team development as leaders. I spoke to two colleagues in the People space, Aloka Penmetcha, Product Leader at Shopify, and Jay O'Connor, Senior Director of Engineering at Slack, to gain insights on how they are managing and developing their distributed teams. <br/> I was curious about how remote management works and how managers can keep track of their teams. Jay explained that remote management is similar to in-person management but has differences. When managing remotely, leaders and employees must create value differently. Effective communication is essential, and leaders must embody the same expectations as they would in person.",
      "subTitle": "Building camaraderie within your team",
      "secondParagraph": "Aloka mentioned that remote management has changed how they build relationships within the team. Checking in over messaging apps and having more casual conversations during one-on-one meetings has been helpful. Jay emphasized the importance of taking time at the beginning of meetings to connect on a personal level.<br/> I couldn’t agree more. I know I make sure I have plenty of time in my meetings. So we can have just that five minutes of “How's it going? How are your kids doing?” Visiting with one another builds relationships.<br/> Jay recommends team members take two minutes to chat and build personal connections. Aloka's team uses a Slack channel, plays remote games, and has team-building events. Jay suggests replicating office interactions virtually, such as coffee breaks or water cooler chats. I like to encourage pair programming and setting working meetings which can increase productivity and social connections.  Remote work presents challenges in building camaraderie, but making an effort to connect is important. Remote work can make networking and career connections harder, so managers must be aware of this. Making connections is essential for growth, success, working well with others, and being inclusive. Finding mentors within the company can also provide growth opportunities.",
      "subTitle2": "Tips on communicating company cultural norms",
      "thirdParagraph": "Organization-specific norms are crucial for work. Unlike technical and theoretical knowledge, 'how we do things around here' varies across companies and is often implicit. This becomes even more challenging for distributed teams working remotely, making communicating company culture difficult. I wondered if my colleagues had tips on teaching new people how to work. I like to make Q&A documents; if someone has a question, you can just write down the question and the answer to share with others.<br/> How can we teach people to work together, and how do we lead to create an effective team culture, especially when working remotely? According to Jay, one way to do this is to lead by example and work in public - that is, show others what you're doing and how you're working. Document it. Share it. Make it visible so that others can learn from you. <br/> Also, make sure everyone knows what's expected of them on the job by defining cultural norms, career ladders, and job rubrics. This way, everyone knows what to do to succeed and can work towards their goals. This, of course, is what we do best at Pando. Embedding work expectations and core competencies in your job rubrics and career ladder helps enshrine your cultural norms. By doing this, you're saying this isn't just a nice to have, it’s critical for you to do your job and for your career.<br/> Building camaraderie and managing time zone differences can be challenging when working remotely. However, you can still contribute to the team's success by providing constructive feedback and messages. Documentation, such as recording daily summaries, can be helpful. Having at least a three-hour overlap between colleagues is crucial - but this is not always possible, especially in teams that are distributed globally. Establishing clear expectations, such as outlining suitable remote projects and alternating meeting times, is important. For new team members, additional overlapping hours during the onboarding period can be beneficial with clear communication and expectations. I have also practiced alternating meeting times to ensure that both parties share the burden of attendance. Both sides feel the pain of either starting super early or working a bit later in the day. They develop empathy for the other person, and it helps people realize just how valuable their time together is.",
      "bannerImage": "/images/banner-02.jpg"
    },
    {
      "id": 5,
      "date": "JUNE 14, 2023",
      "readTime": "3/HALF MIN READ",
      "title": "Retention through coaching: Turn managers into coaches to create opportunities for employee impact",
      "slug": "retention-through-coaching-turn-managersint-coaches-to-create-opportunities-for-employee-impact-",
      "description": "Keep folks on their current path, build systems and coaching culture, and learn new perspectives about coaching and why it's critical to retention.",
      "image": "/images/second_blog.jpg",
      "author": "Kisakye Moses",
      "jobTitle": "Web Developer",
      "thumbnail": "/images/third_blog.jpg",
      "banner": "/images/banner-01.jpg",
      "detailedTitle": "Curiosity and Consistency: How people managers can empower and grow diverse teams",
      "firstParagraph": "As a woman of color who has spent most of my career coming up in a field dominated by men, I was fortunate enough to have been encouraged to advocate for myself—for the way I work best and the circumstances that enable me to achieve my best results. I recognize that not everyone is fortunate enough to have those opportunities, and this realization led me on a journey to help other people have the same supportive work environment. <br />  I’ve worked with a lot of leaders and founders on how to support their teams, so it gave me great pleasure to have the opportunity to sit with my friend, Will Guerra, Head of Culture, Innovation, & Strategy at tEQuitable, to chat about how we can develop managers to empower diverse teams. <br /> <br />Will shared that it was when he found himself in a management consulting role—where he had the opportunity to work on some pretty significant cultural transformation work with large organizations—that he really discovered his passion for diversity, equity, and inclusion. It gave him 'the language to finally understand all the experiences that I had in my life…and of course, from a professional perspective, it just helped me lean even moreinto [becoming] a better people manager.'",
      "subTitle": "Framing Diversit",
      "secondParagraph": "What do we mean when we talk about diverse teams? What is diversity?According to Will, a diverse team is a “group of individuals who have different backgrounds and skills that work together to achieve common goals. They might have differences regarding age, nationality, ethnicity, education, professional background, skills,and of course, different ways of thinking,” and the data shows that diverse teams can outperform less diverse groups by over 30%. We know that diverse teams can increase creativity and innovation. They are better at problem-solving and decision-making. And we also know that individuals can develop and expand their existing skill sets by working collaboratively within a diverse environment—all of which points to increased engagement and reduced turnover. Will says,'This is where leaders need to make sure that everyone feels that they have a voice and contribute to the work of creating space foreveryone to feel included, no matter what their role is...what we’re talking about [here] is inclusion.'",
      "subTitle2": "How Do We Do Inclusion?",
      "thirdParagraph": "Will made some great points about the benefits of diversity and inclusion. When we think about creating diverse teams within organizations, we need to think about a duality. Many organizations are putting resources toward supporting DEI initiatives, and there are many things going on in the People space showing that work is being done to increase inclusion in the workplace. But, I would argue that there’s a big difference, a disconnect between doing inclusion (i.e., making public diversity statements, advertising inclusive policies) and being inclusive. We need to focus on our intentions, like how do we show up as leaders and organizations to support and build diverse teams? It’s a critical but overlooked area of focus. Organizations may be hiring from diverse, marginalized, non-traditional groups, but if the intention behind that is purely so that the numbers look good, “we were able to hire so that our customers are happy,” then we’re not coming from the right intention. If the intentions are not aligned the implementationwill not land well.",
      "bannerImage": "/images/banner-01.jpg"
    },
    {
      "id": 6,
      "date": "JUNE 1, 2023",
      "readTime": "2 MIN READ",
      "title": "Curiosity and Consistency: How people managers can empower and grow diverse teams",
      "slug": "curiosity-and-Consistency-How people-managers-can-empower-and-grow-diverse-teams",
      "description": "How do we 'do' Inclusion? What do leaders really need to think about? Learn how to help managers build diverse teams. ",
      "image": "/images/third_blog.jpg",
      "author": "Uncle Moses",
      "jobTitle": "Graphics Developer",
      "thumbnail": "/images/second_blog.jpg",
      "banner": "/images/banner-01.jpg",
      "detailedTitle": "Managers Develop Diverse and Distributed Teams",
      "firstParagraph": "Research indicates that remote and distributed work is on the rise, with more individuals and organizations considering it a viable option, especially since the pandemic. This trend is driven by many factors, such as the ability to expand the talent pool, greater flexibility in working arrangements, cost savings on infrastructure, and improved work-life balance. However, it's worth considering how this shift towards a more distributed workforce impacts our approach to team development as leaders. I spoke to two colleagues in the People space, Aloka Penmetcha, Product Leader at Shopify, and Jay O'Connor, Senior Director of Engineering at Slack, to gain insights on how they are managing and developing their distributed teams. <br/> I was curious about how remote management works and how managers can keep track of their teams. Jay explained that remote management is similar to in-person management but has differences. When managing remotely, leaders and employees must create value differently. Effective communication is essential, and leaders must embody the same expectations as they would in person.",
      "subTitle": "Building camaraderie within your team",
      "secondParagraph": "Aloka mentioned that remote management has changed how they build relationships within the team. Checking in over messaging apps and having more casual conversations during one-on-one meetings has been helpful. Jay emphasized the importance of taking time at the beginning of meetings to connect on a personal level.<br/> I couldn’t agree more. I know I make sure I have plenty of time in my meetings. So we can have just that five minutes of “How's it going? How are your kids doing?” Visiting with one another builds relationships.<br/> Jay recommends team members take two minutes to chat and build personal connections. Aloka's team uses a Slack channel, plays remote games, and has team-building events. Jay suggests replicating office interactions virtually, such as coffee breaks or water cooler chats. I like to encourage pair programming and setting working meetings which can increase productivity and social connections.  Remote work presents challenges in building camaraderie, but making an effort to connect is important. Remote work can make networking and career connections harder, so managers must be aware of this. Making connections is essential for growth, success, working well with others, and being inclusive. Finding mentors within the company can also provide growth opportunities.",
      "subTitle2": "Tips on communicating company cultural norms",
      "thirdParagraph": "Organization-specific norms are crucial for work. Unlike technical and theoretical knowledge, 'how we do things around here' varies across companies and is often implicit. This becomes even more challenging for distributed teams working remotely, making communicating company culture difficult. I wondered if my colleagues had tips on teaching new people how to work. I like to make Q&A documents; if someone has a question, you can just write down the question and the answer to share with others.<br/> How can we teach people to work together, and how do we lead to create an effective team culture, especially when working remotely? According to Jay, one way to do this is to lead by example and work in public - that is, show others what you're doing and how you're working. Document it. Share it. Make it visible so that others can learn from you. <br/> Also, make sure everyone knows what's expected of them on the job by defining cultural norms, career ladders, and job rubrics. This way, everyone knows what to do to succeed and can work towards their goals. This, of course, is what we do best at Pando. Embedding work expectations and core competencies in your job rubrics and career ladder helps enshrine your cultural norms. By doing this, you're saying this isn't just a nice to have, it’s critical for you to do your job and for your career.<br/> Building camaraderie and managing time zone differences can be challenging when working remotely. However, you can still contribute to the team's success by providing constructive feedback and messages. Documentation, such as recording daily summaries, can be helpful. Having at least a three-hour overlap between colleagues is crucial - but this is not always possible, especially in teams that are distributed globally. Establishing clear expectations, such as outlining suitable remote projects and alternating meeting times, is important. For new team members, additional overlapping hours during the onboarding period can be beneficial with clear communication and expectations. I have also practiced alternating meeting times to ensure that both parties share the burden of attendance. Both sides feel the pain of either starting super early or working a bit later in the day. They develop empathy for the other person, and it helps people realize just how valuable their time together is.",
      "bannerImage": "/images/banner-02.jpg"
    }
  ]
}
